Repository: pingfangx/TranslatorX-other
Catalog: miscellaneous/omegat/project_save.tmx
Source language: en_us
Languages: zh_cn

source: Any Content-Length field value greater than or equal to zero is valid.
zh_cn: 任何大于或等于零的 Content-Length 字段值都是有效的。

source: Any HTTP/1.1 message containing an entity-body SHOULD include a Content-Type header field defining the media type of that body.
zh_cn: 包含实体主体的任何 HTTP/1.1 消息应该包括定义该主体的媒体类型的 Content-Type 首部字段。

source: Any Host header field value in the request MUST be ignored.
zh_cn: 必须忽略请求中的任何 Host 首部字段值。

source: Any LWS that occurs between field-content MAY be replaced with a single SP before interpreting the field value or forwarding the message downstream.
zh_cn: 在解释字段值或向下游转发消息之前，在字段内容之间出现的任何 LWS 都可以用单个 SP 替换。

source: Any cipher suite which defines a different PRF MUST also define the Hash to use in the Finished computation.
zh_cn: 任何定义不同 PRF 的加密套件也必须定义要在 Finished 计算中使用的散列。

source: Any cipher suite which does not explicitly specify verify_data_length has a verify_data_length equal to 12.
zh_cn: 任何未显式指定 verify_data_length 的加密套件的 verify_data_length 都等于 12。

source: Any client or server MAY employ a cache, though a cache cannot be used by a server while it is acting as a tunnel.
zh_cn: 任何客户端或服务器都可以使用缓存，但是当服务器充当隧道时，服务器不能使用缓存。

source: Any client or server may include a cache, though a cache cannot be used by a server that is acting as a tunnel.
zh_cn: 任何客户端或服务器都可以包含缓存，但是作为隧道的服务器不能使用缓存。

source: Any data received after a closure alert is ignored.
zh_cn: 关闭警报后接收到的任何数据都将被忽略。

source: Any endpoint receiving any certificate which it would need to validate using any signature algorithm using an MD5 hash MUST abort the handshake with a "bad_certificate" alert.
zh_cn: 如果端点收到的证书的验证需要用使用 MD5 哈希的签名算法，则端点必须中止握手并发出“bad_certificate”警报。

source: Any future content types MUST specify appropriate rules.
zh_cn: 任何未来的内容类型必须指定适当的规则。

source: Any future values that are allocated must ensure that the transmitted protocol messages unambiguously identify which mode was selected by the server; at present, this is indicated by the presence of the "key_share" in the ServerHello.
zh_cn: 分配的任何未来值必须确保传输的协议消息明确地识别服务器选择的模式；目前，这由 ServerHello 中存在“key_share”表示。

source: Any given OID MUST NOT appear more than once in the filters list.
zh_cn: 任何给定的 OID 绝不能在过滤器列表中出现多次。

source: Any given program may be capable of being both a client and a server; our use of these terms refers only to the role being performed by the program for a particular connection, rather than to the program's capabilities in general.
zh_cn: 任何给定的程序都可以是客户端和服务器；我们对这些术语的使用仅指程序为特定连接执行的角色，而不是程序的一般功能。

source: Any handshake message returned by the server, except for a HelloRequest, is treated as a fatal error.
zh_cn: 除了 HelloRequest 之外，服务器返回的任何握手消息都被视为致命错误。（译注：这里还包括 ServerHello 吧，难道 ServerHello 不是 handshake message）

source: Any party to the communication which is not acting as a tunnel may employ an internal cache for handling requests.
zh_cn: 不充当隧道的通信的任何一方可以使用内部缓存来处理请求。

source: Any protocol designed for use over TLS must be carefully designed to deal with all possible attacks against it.
zh_cn: 任何专为 TLS 使用而设计的协议都必须经过精心设计，以应对所有可能的攻击。

source: Any records following a Finished message MUST be encrypted under the appropriate application traffic key as described in Section 7.2.
zh_cn: Finished 消息之后的任何记录必须用适当的程序通信密钥加密，如第 7.2 节所述。

source: Any response other than a successful response indicates that the tunnel has not yet been formed and that the connection remains governed by HTTP.
zh_cn: 除响应成功之外的任何响应都表示尚未形成隧道，并且连接仍由 HTTP 管理。

source: Any response to a HEAD request and any response with a 1xx (Informational), 204 (No Content), or 304 (Not Modified) status code is always terminated by the first empty line after the header fields, regardless of the header fields present in the message, and thus cannot contain a message body.
zh_cn: 对 HEAD 请求的任何响应以及具有 1xx(信息)，204(无内容)或 304(未修改)状态代码的任何响应始终由首部字段后的第一个空行终止，而不管首部字段是否存在于消息，因此不能包含消息体。

source: Anyone can mint a URI.
zh_cn: 任何人都可以制作一个 URI。

source: Apart from subscribing to the base types with their respective consumers (`Subscriber`, `Observer`, `SingleObserver`, `MaybeObserver` and `CompletableObserver`) and functional-interface based consumers (such as `subscribe(Consumer<T>, Consumer<Throwable>, Action)`), the formerly separate 1.x `BlockingObservable` (and similar classes for the others) has been integrated with the main reactive type.
zh_cn: 除了订阅基本类型用他们各自的消费者（`Subscriber`，`Observer`，`SingleObserver`，`MaybeObserver` 和 `CompletableObserver`）和基于函数接口的消费者（例如 `subscribe(Consumer<T>, Consumer<Throwable>, Action`），以前单独的 1.x `BlockingObservable`（以及其他类似的类）已经与主要的响应类型集成在一起。

source: Appendices
zh_cn: 附录

source: Appendix A. HTTP Version History
zh_cn: 附录 A. HTTP 版本历史

source: Appendix B shows the collected grammar with all list operators expanded to standard ABNF notation.
zh_cn: 附录 B 显示了收集的语法，所有列表操作符都扩展为标准 ABNF 表示法。

source: Appendix B. Collected ABNF
zh_cn: 附录 B.收集的 ABNF

source: Appendix C describes rules imported from other documents.
zh_cn: 附录 C 描述了从其他文档导入的规则。

source: Appendix D shows the collected grammar with all list operators expanded to standard ABNF notation.
zh_cn: 附录 D 显示了收集的语法，所有列表操作符都扩展为标准 ABNF 表示法。

source: Appendix E.5 contains a description of potential attacks, and Section 8 describes mechanisms which the server can use to limit the impact of replay.
zh_cn: 附录 E.5 包含潜在攻击的描述，第 8 节描述了服务器可用于限制重放影响的机制。

source: Application Data MUST NOT be sent prior to sending the Finished message, except as specified in Section 2.3.
zh_cn: 除了第 2.3 节中的规定外，不得在发送完成消息之前发送应用程序数据。

source: Application Data Protocol
zh_cn: 应用数据协议

source: Application Data fragments MAY be split across multiple records or coalesced into a single record.
zh_cn: 应用程序数据片段可以拆分为多个记录，也可以合并为一个记录。

source: Application Data messages are always protected.
zh_cn: 应用程序数据消息始终受到保护。

source: Application Data messages contain data that is opaque to TLS.
zh_cn: 应用程序数据消息包含对 TLS 不透明的数据。

source: Application data is generally of lower precedence for transmission than other content types.
zh_cn: 与其他内容类型相比，应用程序数据的传输优先级通常较低。

source: Application data messages are carried by the record layer and are fragmented, compressed, and encrypted based on the current connection state.
zh_cn: 应用数据信息是由记录层承载并分段，压缩，和基于当前的连接状态进行加密。

source: Applications SHOULD limit their use of character sets to those defined by the IANA registry.
zh_cn: 应用程序应该将字符集的使用限制为 IANA 注册中心定义的字符集。

source: Applications may choose to ignore or reject such data when it is received as part of a reference and should reject the storage of such data in unencrypted form.
zh_cn: 当应用程序作为引用的一部分被接收时，应用程序可以选择忽略或拒绝这些数据，并且应拒绝以未加密的形式存储此类数据。

source: Applications ought to follow "common form", where one is known or indicated, when generating HTTP constructs, since there might exist some implementations that fail to accept anything beyond the common forms.
zh_cn: 应用程序应该遵循“通用形式”，其中一个是已知的或指示的，在生成 HTTP 构造时，因为可能存在一些实现不能接受除通用形式之外的任何内容。

source: Applications should not render as clear text any data after the first colon (":") character found within a userinfo subcomponent unless the data after the colon is the empty string (indicating no password).
zh_cn: 在 userinfo 子组件中找到第一个冒号(“:”)字符后，应用程序不应将任何数据呈现为明文，除非冒号后的数据为空字符串(表示无密码)。

source: Applications that are at least conditionally compliant with this specification SHOULD use an HTTP-Version of "HTTP/1.1" in their messages, and MUST do so for any message that is not compatible with HTTP/1.0.
zh_cn: 至少有条件地符合此规范的应用程序应该在其消息中使用 HTTP 版本的“HTTP/1.1”，并且必须对任何与 HTTP/1.0 不兼容的消息执行此操作。

source: Applications that render a URI for the sake of user feedback, such as in graphical hypertext browsing, should render userinfo in a way that is distinguished from the rest of a URI, when feasible.
zh_cn: 为了用户反馈而呈现 URI 的应用程序(例如在图形超文本浏览中)应该在可行时以与 URI 的其余部分区分的方式呈现 userinfo。

source: Architecture
zh_cn: 结构

source: As a URI suffix has the same syntax as a relative-path reference, a suffix reference cannot be used in contexts where a relative reference is expected.
zh_cn: 由于 URI 后缀与相对路径引用具有相同的语法，因此后缀引用不能用于需要相对引用的上下文中。

source: As a consequence, the hostname for the server is known to the client.
zh_cn: 因此，客户端知道服务器的主机名。

source: As a convention, ABNF rule names prefixed with "obs-" denote "obsolete" grammar rules that appear for historical reasons.
zh_cn: 作为惯例，以“obs-”为前缀的 ABNF 规则名称表示出于历史原因出现的“过时”语法规则。

source: As a general rule, reset (RST) must be sent whenever a segment arrives which apparently is not intended for the current connection.
zh_cn: 作为一般规则，每当显然不是用于当前连接的报文段到达时必须发送重置(RST)。

source: As a practical matter, this means that the protocol designer must be aware of what security properties TLS does and does not provide and cannot safely rely on the latter.
zh_cn: 实际上，这意味着协议设计者必须了解 TLS 所提供和未提供的安全属性，并且不能安全地依赖后者。

source: As a result, A will probably try to OPEN the connection again or try to SEND on the connection it believes open.
zh_cn: 因此，A 可能会尝试再次打开连接或尝试在它认为打开的连接上发送。

source: As a result, suffix references are limited to places where there is no defined base URI, such as dialog boxes and off-line advertisements.
zh_cn: 因此，后缀引用仅限于没有定义基 URI 的位置，例如对话框和离线广告。

source: As a result, this specification does not mandate a particular maximum number of connections but, instead, encourages clients to be conservative when opening multiple connections.
zh_cn: 因此，本规范不要求特定的最大连接数，而是鼓励客户机在打开多个连接时保持保守。

source: As a shorthand, segments carrying the SYN bit are also called "SYNs".
zh_cn: 作为简写，携带 SYN 位的报文段也称为“SYNs”。

source: As a simple example of recovery from old duplicates, consider figure 9.
zh_cn: 作为从旧重复项恢复的简单示例，请考虑图 9。

source: As additional cipher suites are defined for TLS that include new key exchange algorithms, the server key exchange message will be sent if and only if the certificate type associated with the key exchange algorithm does not provide enough information for the client to exchange a premaster secret.
zh_cn: 由于为 TLS 定义了包括新密钥交换算法的附加加密套件，当且仅当与密钥交换算法相关联的证书类型没有为客户端提供足够的信息来交换预主密钥时，才会发送服务器密钥交换消息。

source: As an alternative, the 2.x `Observable` doesn't do backpressure at all and is available as a choice to switch over.
zh_cn: 作为替代方案，2.x `Observable` 根本不做背压，可作为切换的选择。

source: As an exception to this general rule, when the server responds to a ClientHello with a HelloRetryRequest, the value of ClientHello1 is replaced with a special synthetic handshake message of handshake type "message_hash" containing Hash(ClientHello1).
zh_cn: 作为此一般规则的例外，当服务器使用 HelloRetryRequest 响应 ClientHello 时，ClientHello1 的值将替换为包含 Hash(ClientHello1)的握手类型“message_hash”的特殊合成握手消息。

source: As cipher suites that specify new key exchange methods are specified for the TLS protocol, they will imply the certificate format and the required encoded keying information.
zh_cn: 由于为 TLS 协议指定了指定新密钥交换方法的加密套件，因此它们将暗示证书格式和所需的编码密钥信息。

source: As described by Klima [KPR03], these vulnerabilities can be avoided by treating incorrectly formatted message blocks and/or mismatched version numbers in a manner indistinguishable from correctly formatted RSA blocks.
zh_cn: 如 Klima [KPR03] 所述，通过以与正确格式化的 RSA 块无法区分的方式处理格式错误的消息块和/或不匹配的版本号，可以避免这些漏洞。

source: As described in Section 2.3, intermediaries can serve a variety of roles in the processing of HTTP requests and responses.
zh_cn: 如 2.3 节所述，中介可以在处理 HTTP 请求和响应时担任各种角色。

source: As described in Section 5.2, the specific connection protocols to be used for an HTTP interaction are determined by client configuration and the target URI.
zh_cn: 如第 5.2 节所述，用于 HTTP 交互的特定连接协议由客户端配置和目标 URI 确定。

source: As discussed in Section 2, TLS generally uses a common set of messages for authentication, key confirmation, and handshake integrity: Certificate, CertificateVerify, and Finished.
zh_cn: 如第 2 节所述，TLS 通常使用一组通用消息进行身份验证，密钥确认和握手完整性：Certificate，CertificateVerify 和 Finished。

source: As discussed in Section 4.1.3, the HelloRetryRequest has the same format as a ServerHello message, and the legacy_version, legacy_session_id_echo, cipher_suite, and legacy_compression_method fields have the same meaning.
zh_cn: 如 4.1.3 节所述，HelloRetryRequest 具有与 ServerHello 消息相同的格式，legacy_version，legacy_session_id_echo，cipher_suite 和 legacy_compression_method 字段具有相同的含义。

source: As discussed in [PKCS1], the DigestInfo MUST be DER-encoded [X680] [X690].
zh_cn: 正如 [PKCS1] 中所讨论的，DigestInfo 必须是 DER 编码的 [X680] [X690]。

source: As far as HTTP is concerned, Uniform Resource Identifiers are simply formatted strings which identify--via name, location, or any other characteristic--a resource.
zh_cn: 就 HTTP 而言，统一资源标识符是简单的格式化字符串，通过名称，位置或任何其他特征来识别资源。

source: As noted above, the HMAC input can generally be implemented by a running hash, i.e., just the handshake hash at this point.
zh_cn: 如上所述，HMAC 输入通常可以通过运行的散列来实现，即，此时只是握手散列。

source: As of TLS 1.3, servers are permitted to send the "supported_groups" extension to the client.
zh_cn: 从 TLS 1.3 开始，允许服务器向客户端发送“supported_groups”扩展。

source: As one of the primary goals of RxJava 2, the design focuses on performance and in order enable it, RxJava 2.0.7 adds a custom `io.reactivex.FlowableSubscriber` interface (extends `org.reactivestreams.Subscriber`) but adds no new methods to it.
zh_cn: 作为 RxJava 2 的主要目标之一，该设计侧重于性能，为了实现它，RxJava 2.0.7 增加了一个自定义的 `io.reactivex.FlowableSubscriber` 接口(扩展了 `org.reactivestreams.Subscriber`)，但没有添加新的它的方法。

source: As servers MAY require the presence of the "server_name" extension, clients SHOULD send this extension, when applicable.
zh_cn: 由于服务器可能需要存在“server_name”扩展，因此客户端应该在适用时发送此扩展。

source: As shown in Figure 4, the 0-RTT data is just added to the 1-RTT handshake in the first flight.
zh_cn: 如图 4 所示，0-RTT 数据只是添加到第一次飞行中的 1-RTT 握手中。

source: As shown in this illustration, the SubscribeOn operator designates which thread the Observable will begin operating on, no matter at what point in the chain of operators that operator is called.
zh_cn: 如图所示，SubscribeOn 操作符指定 Observable 将开始操作的线程，无论操作符链中的哪个操作符被调用。

source: As specified in [RFC2246], any implementation which receives a connection close without first receiving a valid closure alert (a "premature close") MUST NOT reuse that session.
zh_cn: 如 [RFC2246] 中所述，任何接收到连接关闭而没有首先接收有效闭包警报(“过早关闭”)的实现都不得重用该会话。

source: As such, implementations must not provide the version flag for the existing IPv4 and IPv6 literal address forms described below.
zh_cn: 因此，实现不得为下面描述的现有 IPv4 和 IPv6 文字地址表单提供版本标志。

source: As such, reference authors should not assume that a slightly different, though equivalent, reference URI will (or will not) be interpreted as a same-document reference by any given application.
zh_cn: 因此，引用作者不应假定引用 URI 稍有不同，尽管它是等效的，但任何给定的应用程序都会(或不会)将其解释为相同的文档引用。

source: As such, the URI syntax is a federated and extensible naming system wherein each scheme's specification may further restrict the syntax and semantics of identifiers using that scheme.
zh_cn: 这样，URI 语法是联合和可扩展的命名系统，其中每个方案的规范可以进一步限制使用该方案的标识符的语法和语义。

source: As such, the fragment identifier is not used in the scheme-specific processing of a URI; instead, the fragment identifier is separated from the rest of the URI prior to a dereference, and thus the identifying information within the fragment itself is dereferenced solely by the user agent, regardless of the URI scheme.
zh_cn: 因此，片段标识符不用于 URI 的特定于方案的处理；相反，片段标识符在解除引用之前与 URI 的其余部分分开，因此片段本身内的识别信息仅由用户代理解除引用，而不管 URI 方案如何。

source: As the opportunity to reduce component count, 2.x doesn't define `Action3`-`Action9` and `ActionN` (these were unused within RxJava itself anyway).
zh_cn: 作为减少组件数量的机会，2.x 没有定义 `Action3`-`Action9` 和 `ActionN`(无论如何这些都在 RxJava 本身中未使用)。

source: As the server is authenticating via a PSK, it does not send a Certificate or a CertificateVerify message.
zh_cn: 由于服务器通过 PSK 进行身份验证，因此它不会发送证书或 CertificateVerify 消息。

source: As with any URI, use of a fragment identifier component does not imply that a retrieval action will take place.
zh_cn: 与任何 URI 一样，使用片段标识符组件并不意味着将发生检索操作。

source: As with the ServerHello, a HelloRetryRequest MUST NOT contain any extensions that were not first offered by the client in its ClientHello, with the exception of optionally the "cookie" (see Section 4.2.2) extension.
zh_cn: 与 ServerHello 一样，HelloRetryRequest 绝不能包含客户端在其 ClientHello 中最初没有提供的任何扩展，除了可选的“cookie”(参见第 4.2.2 节)扩展。

source: As with the `Observable`/`Flowable` split, the backpressure-aware, Reactive-Streams compliant implementations are based on the `FlowableProcessor<T>` class (which extends `Flowable` to give a rich set of instance operators).
zh_cn: 与 `Observable`/`Flowable` 拆分一样，背压感知，Reactive-Streams 兼容实现基于 `FlowableProcessor<T>` 类(扩展 `Flowable` 以提供丰富的实例操作符集)。

source: Aside from dot-segments in hierarchical paths, a path segment is considered opaque by the generic syntax.
zh_cn: 除了分层路径中的点段之外，通用语法将路径段视为不透明。

source: Aside from passing these Schedulers in to RxJava Observable operators, you can also use them to schedule your own work on Subscriptions.
zh_cn: 除了将这些调度器传递给 RxJava Observable 操作符之外，您还可以使用它们来安排自己的订阅工作。

source: Aside from the cases defined above, in the absence of Transfer-Encoding, an origin server SHOULD send a Content-Length header field when the payload body size is known prior to sending the complete header section.
zh_cn: 除了上面定义的情况之外，在没有 Transfer-Encoding 的情况下，在发送完整的首部分之前，当有效载荷主体大小已知时，源服务器应该发送 Content-Length 首部字段。

source: Associating a Response to a Request
zh_cn: 将响应与请求相关联

source: Assume that two user processes A and B are communicating with one another when a crash occurs causing loss of memory to A's TCP.
zh_cn: 假设发生崩溃时两个用户进程 A 和 B 正在彼此通信，从而导致 A 的 TCP 内存丢失。

source: At 100 megabits/sec, the cycle time is 5.4 minutes which may be a little short, but still within reason.
zh_cn: 在 100 兆比特/秒时，循环时间为 5.4 分钟，这可能有点短，但仍然在合理范围内。

source: At 2 megabits/sec.
zh_cn: 以 2 兆比特/秒。

source: At a minimum, a recipient MUST be able to parse and process protocol element lengths that are at least as long as the values that it generates for those same protocol elements in other messages.
zh_cn: 接收者必须至少能够解析和处理协议元素长度，该协议元素长度至少与它为其他消息中的那些相同协议元素生成的值一样长。

source: At each invocation, it has to call `onNext` at most once optionally followed by either `onError` or `onComplete`.
zh_cn: 在每次调用时，它必须最多调用 `onNext` 一次，可选地后跟 `onError` 或 `onComplete`。

source: At each layer, messages may include fields for length, description, and content.
zh_cn: 在每一层，消息可以包括长度，描述和内容的字段。

source: At least one delimiter (LWS and/or separators) MUST exist between any two tokens (for the definition of "token" below), since they would otherwise be interpreted as a single token.
zh_cn: 任何两个标记之间必须至少有一个分隔符(LWS 和/或分隔符)(对于下面“token”的定义)，因为否则它们将被解释为单个标记。

source: At line 3, an old duplicate SYN arrives at TCP B. TCP B cannot tell that this is an old duplicate, so it responds normally (line 4).
zh_cn: 在第 3 行，旧的重复的 SYN 到达 TCP B.TCP B 无法判断这是一个旧副本，因此它正常响应(第 4 行)。

source: At line 4, TCP A responds with an empty segment containing an ACK for TCP B's SYN; and in line 5, TCP A sends some data.
zh_cn: 在第 4 行，TCP A 响应一个包含确认 TCP B 的 SYN 的 ACK 空报文段；在第 5 行中，TCP A 发送一些数据。

source: At that point, the original requester can decide whether to proceed with the connection.
zh_cn: 此时，原始请求者可以决定是否继续连接。

source: At the lowest level, layered on top of some reliable transport protocol (e.g., TCP [TCP]), is the TLS Record Protocol.
zh_cn: 在最低级别，在一些可靠的传输协议(例如，TCP [TCP])之上分层是 TLS 记录协议。

source: At this point, a ChangeCipherSpec message is sent by the client, and the client copies the pending Cipher Spec into the current Cipher Spec.
zh_cn: 此时，客户端发送 ChangeCipherSpec 消息，客户端将挂起的加密规范复制到当前的加密规范中。

source: At this point, both client and server MUST send ChangeCipherSpec messages and proceed directly to Finished messages.
zh_cn: 此时，客户端和服务器必须发送 ChangeCipherSpec 消息并直接进入 Finished 消息。

source: At this point, the data is not flowing yet and no side-effects are happening.
zh_cn: 此时，数据尚未流动，并且没有发生任何副作用。

source: At this point, the handshake is complete, and the client and server derive the keying material required by the record layer to exchange application-layer data protected through authenticated encryption.
zh_cn: 此时，握手完成，客户端和服务器导出记录层所需的密钥材料，以交换通过认证加密保护的应用层数据。

source: At this point, the handshake is complete, and the client and server may begin to exchange application layer data.
zh_cn: 此时，握手完成，客户端和服务器可以开始交换应用层数据。

source: Attach the observer to that Observable by subscribing it (this also initiates the actions of the Observable).
zh_cn: 通过 subscribing (订阅) 将观察者附加到该 Observable(这也启动了 Observable 的操作)。

source: Attacks Based On File and Path Names
zh_cn: 基于文件和路径名的攻击

source: Attacks Based on Command, Code, or Query Injection
zh_cn: 基于命令，代码或查询注入的攻击

source: Attacks Based on File and Path Names
zh_cn: 基于文件和路径名的攻击

source: Attacks via Protocol Element Length
zh_cn: 通过协议元素长度进行攻击

source: Audience Language
zh_cn: 受众语言

source: Augmented BNF
zh_cn: 增强的 BNF

source: Authentication Challenges
zh_cn: 身份验证挑战

source: Authentication Credentials
zh_cn: 身份验证凭据

source: Authentication Credentials and Idle Clients
zh_cn: 身份验证凭据和空闲客户端

source: Authentication can happen via asymmetric cryptography (e.g., RSA [RSA], the Elliptic Curve Digital Signature Algorithm (ECDSA) [ECDSA], or the Edwards-Curve Digital Signature Algorithm (EdDSA) [RFC8032]) or a symmetric pre-shared key (PSK).
zh_cn: 身份验证可以通过非对称加密(例如，RSA [RSA]，椭圆曲线数字签名算法(ECDSA)[ECDSA] 或 Edwards 曲线数字签名算法(EdDSA)[RFC8032])或对称预共享密钥( PSK)。

source: Author's Address
zh_cn: 作者地址

source: Authors' Addresses
zh_cn: 作者地址

source: Automated clients MAY provide a configuration setting that disables this check, but MUST provide a setting which enables it.
zh_cn: 自动化客户端可以提供禁用此检查的配置设置，但必须提供启用它的设置。

source: Automated clients MUST log the error to an appropriate audit log (if available) and SHOULD terminate the connection (with a bad certificate error).
zh_cn: 自动客户端必须将错误记录到适当的审核日志(如果可用)，并且应该终止连接(证书错误)。

source: Background
zh_cn: 背景

source: Backpressure Operators
zh_cn: 背压操作符

source: Base URI Embedded in Content
zh_cn: 内容中嵌入的基本 URI

source: Base URI from the Encapsulating Entity
zh_cn: 封装实体的基本 URI

source: Base URI from the Retrieval URI
zh_cn: 检索 URI 中的基本 URI

source: Based on these inputs, the messages then contain:
zh_cn: 根据这些输入，消息包含：

source: Basic 3-Way Handshake for Connection Synchronization
zh_cn: 连接同步的基本三次握手

source: Basic Block Size
zh_cn: 基本块大小

source: Basic Rules
zh_cn: 基本规则

source: Because DSA signatures do not contain any secure indication of hash algorithm, there is a risk of hash substitution if multiple hashes may be used with any key.
zh_cn: 由于 DSA 签名不包含散列算法的任何安全指示，因此如果多个散列可以与任何键一起使用，则存在散列替换的风险。

source: Because HTTP uses connection closure to signal end of server data, client implementations MUST treat any premature closes as errors and the data received as potentially truncated.
zh_cn: 因为 HTTP 使用连接闭包来指示服务器数据的结束，所以客户端实现必须将任何过早关闭视为错误，并将接收到的数据视为可能被截断。

source: Because Reactive-Streams base interface, `org.reactivestreams.Publisher` defines the `subscribe()` method as `void`, `Flowable.subscribe(Subscriber)` no longer returns any `Subscription` (or `Disposable`).
zh_cn: 因为 Reactive-Streams 基接口，`org.reactivestreams.Publisher` 将 `subscribe()` 方法定义为 `void`，`Flowable.subscribe(Subscriber)` 不再返回任何 `Subscription`(或 `Disposable`)。

source: Because Reactive-Streams has a different architecture, it mandates changes to some well known RxJava types.
zh_cn: 由于 Reactive-Streams 具有不同的体系结构，因此它要求对一些众所周知的 RxJava 类型进行更改。

source: Because TLS 1.3 changes the way keys are derived, it updates [RFC5705] as described in Section 7.5.
zh_cn: 由于 TLS 1.3 更改了密钥的派生方式，因此会按照第 7.5 节中的说明更新 [RFC5705]。

source: Because TLS 1.3 forbids renegotiation, if a server has negotiated TLS 1.3 and receives a ClientHello at any other time, it MUST terminate the connection with an "unexpected_message" alert.
zh_cn: 因为 TLS 1.3 禁止重新协商，如果服务器已协商 TLS 1.3 并在任何其他时间收到 ClientHello，它必须使用“unexpected_message”警报终止连接。
